a = int(input())
if (a % 20 == 0) or ((a - 5) % 20 == 0) or ((a - 6) % 20 == 0):  #програмистов
    print(a, 'программистов')
elif ((a - 7) % 20 == 0) or ((a - 8) % 20 == 0) or ((a - 9) % 20 == 0) or ((a - 10) % 20 == 0):       #програмистОВ
    print(a, 'программистов')
elif ((a - 15) % 20 == 0) or ((a - 16) % 20 == 0) or ((a - 17) % 20 == 0) or ((a - 18) % 20 == 0):    #програмистОВ
    print(a, 'программистов')
elif ((a - 19) % 20 == 0) or ((a - 11) % 100 == 0) or ((a - 12) % 100 == 0) or ((a - 13) % 100 == 0): #програмистОВ
    print(a, 'программистов')
elif (a - 14) % 100 == 0:                                                                              #програмистОВ
    print(a, 'программистов')
elif ((a - 2) % 20 == 0) or ((a - 3) % 20 == 0) or ((a - 4) % 20 == 0):                                #програмистА
    print(a, 'программиста')
elif (((a - 12) % 20 == 0) and (not ((a - 12) % 100 == 0))):                                            #програмистА
    print(a, 'программиста')
elif (((a - 13) % 20 == 0) and (not ((a - 13) % 100 == 0))):                                            #програмистА
    print(a, 'программиста')
elif (((a - 14) % 20 == 0) and (not ((a - 14) % 100 == 0))):                                             #програмистА
    print(a, 'программиста')
else:                                                                                                   #програмист
    print(a, 'программист')